Revit 2016 API
Document.NewFoundationWall Method
Creates a new wall foundation object.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public WallFoundation NewFoundationWall(
	WallFoundationType wallFoundationType,
	Wall wall
)
Visual Basic
Public Function NewFoundationWall ( _
	wallFoundationType As WallFoundationType, _
	wall As Wall _
) As WallFoundation
Visual C++
public:
WallFoundation^ NewFoundationWall(
	WallFoundationType^ wallFoundationType,
	Wall^ wall
)
Parameters
wallFoundationType
Type: Autodesk.Revit.DB.WallFoundationType
The WallFoundation type.
wall
Type: Autodesk.Revit.DB.Wall
The Wall to append a WallFoundation.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the wall foundation type does not exist in the given document.
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the wall does not exist in the given document.
See Also
Document Class
Autodesk.Revit.Creation Namespace